/* automatically generated by rust-bindgen 0.58.1 */

pub const portNUM_PROCESSORS: u32 = 2;
pub const XT_USE_THREAD_SAFE_CLIB: u32 = 0;
pub const configASSERT_2: u32 = 0;
pub const portUSING_MPU_WRAPPERS: u32 = 0;
pub const configUSE_MUTEX: u32 = 1;
pub const XT_TIMER_INDEX: u32 = 0;
pub const configNUM_THREAD_LOCAL_STORAGE_POINTERS: u32 = 1;
pub const configTHREAD_LOCAL_STORAGE_DELETE_CALLBACKS: u32 = 1;
pub const XTHAL_RELEASE_MAJOR: u32 = 12000;
pub const XTHAL_RELEASE_MINOR: u32 = 9;
pub const XTHAL_RELEASE_NAME: &'static [u8; 7usize] = b"12.0.9\0";
pub const XTHAL_REL_12: u32 = 1;
pub const XTHAL_REL_12_0: u32 = 1;
pub const XTHAL_REL_12_0_9: u32 = 1;
pub const XTHAL_MAJOR_REV: u32 = 12000;
pub const XTHAL_MINOR_REV: u32 = 9;
pub const XTHAL_MAYBE: i32 = -1;
pub const XTHAL_MAX_CPS: u32 = 8;
pub const XTHAL_LITTLEENDIAN: u32 = 0;
pub const XTHAL_BIGENDIAN: u32 = 1;
pub const XTHAL_PREFETCH_ENABLE: i32 = -1;
pub const XTHAL_PREFETCH_DISABLE: u32 = 4294901760;
pub const XTHAL_DCACHE_PREFETCH_L1_OFF: u32 = 2415919104;
pub const XTHAL_DCACHE_PREFETCH_L1: u32 = 2415923200;
pub const XTHAL_ICACHE_PREFETCH_L1_OFF: u32 = 2684354560;
pub const XTHAL_ICACHE_PREFETCH_L1: u32 = 2684362752;
pub const XTHAL_DISASM_BUFSIZE: u32 = 80;
pub const XTHAL_DISASM_OPT_ADDR: u32 = 1;
pub const XTHAL_DISASM_OPT_OPHEX: u32 = 2;
pub const XTHAL_DISASM_OPT_OPCODE: u32 = 4;
pub const XTHAL_DISASM_OPT_PARMS: u32 = 8;
pub const XTHAL_DISASM_OPT_ALL: u32 = 4095;

pub const INCLUDE_uxTaskGetStackHighWaterMark2: u32 = 0;
pub const INCLUDE_xTaskResumeFromISR: u32 = 1;
pub const INCLUDE_xTaskGetSchedulerState: u32 = 0;
pub const INCLUDE_xTaskGetCurrentTaskHandle: u32 = 0;
pub const configUSE_DAEMON_TASK_STARTUP_HOOK: u32 = 0;
pub const configUSE_APPLICATION_TASK_TAG: u32 = 0;
pub const configUSE_ALTERNATIVE_API: u32 = 0;
pub const configASSERT_DEFINED: u32 = 1;
pub const configPRECONDITION_DEFINED: u32 = 0;
pub const configRECORD_STACK_HIGH_ADDRESS: u32 = 0;
pub const configINCLUDE_FREERTOS_TASK_C_ADDITIONS_H: u32 = 0;
pub const configGENERATE_RUN_TIME_STATS: u32 = 0;
pub const configUSE_MALLOC_FAILED_HOOK: u32 = 0;
pub const configEXPECTED_IDLE_TIME_BEFORE_SLEEP: u32 = 2;
pub const configUSE_TIME_SLICING: u32 = 1;
pub const configINCLUDE_APPLICATION_DEFINED_PRIVILEGED_FUNCTIONS: u32 = 0;
pub const configUSE_STATS_FORMATTING_FUNCTIONS: u32 = 0;
pub const configUSE_TRACE_FACILITY: u32 = 0;
pub const configUSE_PORT_OPTIMISED_TASK_SELECTION: u32 = 0;
pub const configUSE_TASK_NOTIFICATIONS: u32 = 1;
pub const configTASK_NOTIFICATION_ARRAY_ENTRIES: u32 = 1;
pub const configUSE_POSIX_ERRNO: u32 = 0;
pub const portTICK_TYPE_IS_ATOMIC: u32 = 0;
pub const configINITIAL_TICK_COUNT: u32 = 0;
pub const configENABLE_BACKWARD_COMPATIBILITY: u32 = 1;
pub const configUSE_TASK_FPU_SUPPORT: u32 = 1;
pub const configENABLE_MPU: u32 = 0;
pub const configENABLE_FPU: u32 = 1;
pub const configENABLE_TRUSTZONE: u32 = 1;
pub const configRUN_FREERTOS_SECURE_ONLY: u32 = 0;
pub const configRUN_ADDITIONAL_TESTS: u32 = 0;
pub const tskKERNEL_VERSION_NUMBER: &'static [u8; 8usize] = b"V10.4.4\0";
pub const tskKERNEL_VERSION_MAJOR: u32 = 10;
pub const tskKERNEL_VERSION_MINOR: u32 = 4;
pub const tskKERNEL_VERSION_BUILD: u32 = 4;
pub const tskMPU_REGION_READ_ONLY: u32 = 1;
pub const tskMPU_REGION_READ_WRITE: u32 = 2;
pub const tskMPU_REGION_EXECUTE_NEVER: u32 = 4;
pub const tskMPU_REGION_NORMAL_MEMORY: u32 = 8;
pub const tskMPU_REGION_DEVICE_MEMORY: u32 = 16;
pub const tskDEFAULT_INDEX_TO_NOTIFY: u32 = 0;
pub const ATOMIC_COMPARE_AND_SWAP_SUCCESS: u32 = 1;
pub const ATOMIC_COMPARE_AND_SWAP_FAILURE: u32 = 0;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = chlorine::c_longlong;
pub type uintmax_t = chlorine::c_ulonglong;
pub type wchar_t = chlorine::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: chlorine::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub static Xthal_rev_no: chlorine::c_uint;
}
extern "C" {
    pub fn xthal_save_extra(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_extra(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cpregs(base: *mut chlorine::c_void, arg1: chlorine::c_int);
}
extern "C" {
    pub fn xthal_restore_cpregs(base: *mut chlorine::c_void, arg1: chlorine::c_int);
}
extern "C" {
    pub fn xthal_save_cp0(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp1(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp2(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp3(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp4(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp5(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp6(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_save_cp7(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp0(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp1(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp2(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp3(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp4(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp5(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp6(base: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_restore_cp7(base: *mut chlorine::c_void);
}
extern "C" {
    pub static mut Xthal_cpregs_save_fn: [*mut chlorine::c_void; 8usize];
}
extern "C" {
    pub static mut Xthal_cpregs_restore_fn: [*mut chlorine::c_void; 8usize];
}
extern "C" {
    pub static mut Xthal_cpregs_save_nw_fn: [*mut chlorine::c_void; 8usize];
}
extern "C" {
    pub static mut Xthal_cpregs_restore_nw_fn: [*mut chlorine::c_void; 8usize];
}
extern "C" {
    pub static Xthal_extra_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_extra_align: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cpregs_size: [chlorine::c_uint; 8usize];
}
extern "C" {
    pub static Xthal_cpregs_align: [chlorine::c_uint; 8usize];
}
extern "C" {
    pub static Xthal_all_extra_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_all_extra_align: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_names: [*const chlorine::c_char; 8usize];
}
extern "C" {
    pub fn xthal_init_mem_extra(arg1: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_init_mem_cp(arg1: *mut chlorine::c_void, arg2: chlorine::c_int);
}
extern "C" {
    pub static Xthal_num_coprocessors: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_num: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_max: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_num_aregs: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_num_aregs_log2: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_icache_linewidth: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dcache_linewidth: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_icache_linesize: chlorine::c_ushort;
}
extern "C" {
    pub static Xthal_dcache_linesize: chlorine::c_ushort;
}
extern "C" {
    pub static Xthal_icache_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_dcache_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_dcache_is_writeback: chlorine::c_uchar;
}
extern "C" {
    pub fn xthal_icache_region_invalidate(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_region_invalidate(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_region_writeback(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_region_writeback_inv(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_icache_line_invalidate(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_dcache_line_invalidate(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_dcache_line_writeback(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_dcache_line_writeback_inv(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_icache_sync();
}
extern "C" {
    pub fn xthal_dcache_sync();
}
extern "C" {
    pub fn xthal_icache_get_ways() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_icache_set_ways(ways: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_get_ways() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_dcache_set_ways(ways: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_cache_coherence_on();
}
extern "C" {
    pub fn xthal_cache_coherence_off();
}
extern "C" {
    pub fn xthal_cache_coherence_optin();
}
extern "C" {
    pub fn xthal_cache_coherence_optout();
}
extern "C" {
    pub fn xthal_get_cache_prefetch() -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_cache_prefetch(arg1: chlorine::c_int) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_cache_prefetch_long(arg1: chlorine::c_ulonglong) -> chlorine::c_int;
}
extern "C" {
    pub static Xthal_debug_configured: chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_soft_break(addr: *mut chlorine::c_void) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_remove_soft_break(addr: *mut chlorine::c_void, arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_disassemble(
        instr_buf: *mut chlorine::c_uchar,
        tgt_addr: *mut chlorine::c_void,
        buffer: *mut chlorine::c_char,
        buflen: chlorine::c_uint,
        options: chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_disassemble_size(instr_buf: *mut chlorine::c_uchar) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_memcpy(
        dst: *mut chlorine::c_void,
        src: *const chlorine::c_void,
        len: chlorine::c_uint,
    ) -> *mut chlorine::c_void;
}
extern "C" {
    pub fn xthal_bcopy(
        src: *const chlorine::c_void,
        dst: *mut chlorine::c_void,
        len: chlorine::c_uint,
    ) -> *mut chlorine::c_void;
}
extern "C" {
    pub fn xthal_compare_and_set(
        addr: *mut chlorine::c_int,
        test_val: chlorine::c_int,
        compare_val: chlorine::c_int,
    ) -> chlorine::c_int;
}
extern "C" {
    pub static Xthal_release_major: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_release_minor: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_release_name: *const chlorine::c_char;
}
extern "C" {
    pub static Xthal_release_internal: *const chlorine::c_char;
}
extern "C" {
    pub static Xthal_memory_order: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_windowed: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_density: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_booleans: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_loops: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_nsa: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_minmax: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_sext: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_clamps: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_mac16: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_mul16: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_fp: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_speculation: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_threadptr: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_pif: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_writebuffer_entries: chlorine::c_ushort;
}
extern "C" {
    pub static Xthal_build_unique_id: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_hw_configid0: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_hw_configid1: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_hw_release_major: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_hw_release_minor: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_hw_release_name: *const chlorine::c_char;
}
extern "C" {
    pub static Xthal_hw_release_internal: *const chlorine::c_char;
}
extern "C" {
    pub fn xthal_clear_regcached_code();
}
extern "C" {
    pub fn xthal_window_spill();
}
extern "C" {
    pub fn xthal_validate_cp(arg1: chlorine::c_int);
}
extern "C" {
    pub fn xthal_invalidate_cp(arg1: chlorine::c_int);
}
extern "C" {
    pub fn xthal_set_cpenable(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_get_cpenable() -> chlorine::c_uint;
}
extern "C" {
    pub static Xthal_num_intlevels: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_interrupts: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_excm_level: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_intlevel_mask: [chlorine::c_uint; 16usize];
}
extern "C" {
    pub static Xthal_intlevel_andbelow_mask: [chlorine::c_uint; 16usize];
}
extern "C" {
    pub static Xthal_intlevel: [chlorine::c_uchar; 32usize];
}
extern "C" {
    pub static Xthal_inttype: [chlorine::c_uchar; 32usize];
}
extern "C" {
    pub static Xthal_inttype_mask: [chlorine::c_uint; 11usize];
}
extern "C" {
    pub static Xthal_timer_interrupt: [chlorine::c_int; 4usize];
}
extern "C" {
    pub fn xthal_get_intenable() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_intenable(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_get_interrupt() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_intset(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_set_intclear(arg1: chlorine::c_uint);
}
extern "C" {
    pub static Xthal_num_ibreak: chlorine::c_int;
}
extern "C" {
    pub static Xthal_num_dbreak: chlorine::c_int;
}
extern "C" {
    pub static Xthal_have_ccount: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_ccompare: chlorine::c_uchar;
}
extern "C" {
    pub fn xthal_get_ccount() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_ccompare(arg1: chlorine::c_int, arg2: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_get_ccompare(arg1: chlorine::c_int) -> chlorine::c_uint;
}
extern "C" {
    pub static Xthal_have_prid: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_exceptions: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_xea_version: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_interrupts: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_highlevel_interrupts: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_nmi: chlorine::c_uchar;
}
extern "C" {
    pub fn xthal_get_prid() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_vpri_to_intlevel(vpri: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_intlevel_to_vpri(intlevel: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_int_enable(arg1: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_int_disable(arg1: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_int_vpri(intnum: chlorine::c_int, vpri: chlorine::c_int) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_get_int_vpri(intnum: chlorine::c_int) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_vpri_locklevel(intlevel: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_get_vpri_locklevel() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_vpri(vpri: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_get_vpri() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_vpri_intlevel(intlevel: chlorine::c_uint) -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_vpri_lock() -> chlorine::c_uint;
}
pub type XtHalVoidFunc = ::core::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub static mut Xthal_tram_pending: chlorine::c_uint;
}
extern "C" {
    pub static mut Xthal_tram_enabled: chlorine::c_uint;
}
extern "C" {
    pub static mut Xthal_tram_sync: chlorine::c_uint;
}
extern "C" {
    pub fn xthal_tram_pending_to_service() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_tram_done(serviced_mask: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_tram_set_sync(intnum: chlorine::c_int, sync: chlorine::c_int) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_tram_trigger_func(trigger_fn: XtHalVoidFunc) -> XtHalVoidFunc;
}
extern "C" {
    pub static Xthal_num_instrom: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_instram: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_datarom: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_dataram: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_num_xlmi: chlorine::c_uchar;
}
extern "C" {
    pub static mut Xthal_instrom_vaddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_instrom_paddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_instrom_size: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_instram_vaddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_instram_paddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_instram_size: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_datarom_vaddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_datarom_paddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_datarom_size: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_dataram_vaddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_dataram_paddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_dataram_size: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_xlmi_vaddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_xlmi_paddr: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static mut Xthal_xlmi_size: [chlorine::c_uint; 0usize];
}
extern "C" {
    pub static Xthal_icache_setwidth: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dcache_setwidth: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_icache_ways: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_dcache_ways: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_icache_line_lockable: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dcache_line_lockable: chlorine::c_uchar;
}
extern "C" {
    pub fn xthal_get_cacheattr() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_get_icacheattr() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_get_dcacheattr() -> chlorine::c_uint;
}
extern "C" {
    pub fn xthal_set_cacheattr(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_set_icacheattr(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_set_dcacheattr(arg1: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_set_region_attribute(
        addr: *mut chlorine::c_void,
        size: chlorine::c_uint,
        cattr: chlorine::c_uint,
        flags: chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_icache_enable();
}
extern "C" {
    pub fn xthal_dcache_enable();
}
extern "C" {
    pub fn xthal_icache_disable();
}
extern "C" {
    pub fn xthal_dcache_disable();
}
extern "C" {
    pub fn xthal_icache_all_invalidate();
}
extern "C" {
    pub fn xthal_dcache_all_invalidate();
}
extern "C" {
    pub fn xthal_dcache_all_writeback();
}
extern "C" {
    pub fn xthal_dcache_all_writeback_inv();
}
extern "C" {
    pub fn xthal_icache_all_unlock();
}
extern "C" {
    pub fn xthal_dcache_all_unlock();
}
extern "C" {
    pub fn xthal_icache_region_lock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_region_lock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_icache_region_unlock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_region_unlock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_icache_hugerange_invalidate(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_icache_hugerange_unlock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_hugerange_invalidate(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_hugerange_unlock(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_hugerange_writeback(addr: *mut chlorine::c_void, size: chlorine::c_uint);
}
extern "C" {
    pub fn xthal_dcache_hugerange_writeback_inv(
        addr: *mut chlorine::c_void,
        size: chlorine::c_uint,
    );
}
extern "C" {
    pub fn xthal_icache_line_lock(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_dcache_line_lock(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_icache_line_unlock(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_dcache_line_unlock(addr: *mut chlorine::c_void);
}
extern "C" {
    pub fn xthal_memep_inject_error(
        addr: *mut chlorine::c_void,
        size: chlorine::c_int,
        flags: chlorine::c_int,
    );
}
extern "C" {
    pub static Xthal_have_spanning_way: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_identity_map: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_mimic_cacheattr: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_xlt_cacheattr: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_cacheattr: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_have_tlbs: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_asid_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_asid_kernel: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_rings: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_ring_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_sr_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_ca_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_mmu_max_pte_page_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_mmu_min_pte_page_size: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_itlb_way_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_itlb_ways: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_itlb_arf_ways: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dtlb_way_bits: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dtlb_ways: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_dtlb_arf_ways: chlorine::c_uchar;
}
extern "C" {
    pub fn xthal_static_v2p(
        vaddr: chlorine::c_uint,
        paddrp: *mut chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_static_p2v(
        paddr: chlorine::c_uint,
        vaddrp: *mut chlorine::c_uint,
        cached: chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_region_translation(
        vaddr: *mut chlorine::c_void,
        paddr: *mut chlorine::c_void,
        size: chlorine::c_uint,
        cache_atr: chlorine::c_uint,
        flags: chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_v2p(
        arg1: *mut chlorine::c_void,
        arg2: *mut *mut chlorine::c_void,
        arg3: *mut chlorine::c_uint,
        arg4: *mut chlorine::c_uint,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_invalidate_region(addr: *mut chlorine::c_void) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_set_region_translation_raw(
        vaddr: *mut chlorine::c_void,
        paddr: *mut chlorine::c_void,
        cattr: chlorine::c_uint,
    ) -> chlorine::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xthal_MPU_entry {
    pub as_: u32,
    pub at: u32,
}
#[test]
fn bindgen_test_layout_xthal_MPU_entry() {
    assert_eq!(
        ::core::mem::size_of::<xthal_MPU_entry>(),
        8usize,
        concat!("Size of: ", stringify!(xthal_MPU_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<xthal_MPU_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(xthal_MPU_entry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xthal_MPU_entry>())).as_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xthal_MPU_entry),
            "::",
            stringify!(as_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xthal_MPU_entry>())).at as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xthal_MPU_entry),
            "::",
            stringify!(at)
        )
    );
}
extern "C" {
    pub static mut Xthal_mpu_bgmap: [xthal_MPU_entry; 0usize];
}
extern "C" {
    pub fn xthal_is_kernel_readable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_kernel_writeable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_kernel_executable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_user_readable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_user_writeable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_user_executable(accessRights: u32) -> i32;
}
extern "C" {
    pub fn xthal_encode_memory_type(x: u32) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_is_cacheable(memoryType: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_writeback(memoryType: u32) -> i32;
}
extern "C" {
    pub fn xthal_is_device(memoryType: u32) -> i32;
}
extern "C" {
    pub fn xthal_read_map(entries: *mut xthal_MPU_entry) -> i32;
}
extern "C" {
    pub fn xthal_write_map(entries: *const xthal_MPU_entry, n: u32);
}
extern "C" {
    pub fn xthal_check_map(entries: *const xthal_MPU_entry, n: u32) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_get_entry_for_address(
        vaddr: *mut chlorine::c_void,
        infgmap: *mut i32,
    ) -> xthal_MPU_entry;
}
extern "C" {
    pub fn xthal_calc_cacheadrdis(e: *const xthal_MPU_entry, n: u32) -> u32;
}
extern "C" {
    pub fn xthal_mpu_set_region_attribute(
        vaddr: *mut chlorine::c_void,
        size: usize,
        accessRights: i32,
        memoryType: i32,
        flags: u32,
    ) -> chlorine::c_int;
}
extern "C" {
    pub fn xthal_read_background_map(entries: *mut xthal_MPU_entry) -> i32;
}
extern "C" {
    pub static Xthal_cp_id_FPU: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_FPU: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP1_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP1_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP2_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP2_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP3_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP3_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP4_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP4_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP5_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP5_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP6_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP6_IDENT: chlorine::c_uint;
}
extern "C" {
    pub static Xthal_cp_id_XCHAL_CP7_IDENT: chlorine::c_uchar;
}
extern "C" {
    pub static Xthal_cp_mask_XCHAL_CP7_IDENT: chlorine::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XtExcFrame {
    pub exit: u32,
    pub pc: u32,
    pub ps: u32,
    pub a0: u32,
    pub a1: u32,
    pub a2: u32,
    pub a3: u32,
    pub a4: u32,
    pub a5: u32,
    pub a6: u32,
    pub a7: u32,
    pub a8: u32,
    pub a9: u32,
    pub a10: u32,
    pub a11: u32,
    pub a12: u32,
    pub a13: u32,
    pub a14: u32,
    pub a15: u32,
    pub sar: u32,
    pub exccause: u32,
    pub excvaddr: u32,
    pub lbeg: u32,
    pub lend: u32,
    pub lcount: u32,
    pub tmp0: u32,
    pub tmp1: u32,
    pub tmp2: u32,
}
#[test]
fn bindgen_test_layout_XtExcFrame() {
    assert_eq!(
        ::core::mem::size_of::<XtExcFrame>(),
        112usize,
        concat!("Size of: ", stringify!(XtExcFrame))
    );
    assert_eq!(
        ::core::mem::align_of::<XtExcFrame>(),
        4usize,
        concat!("Alignment of ", stringify!(XtExcFrame))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).exit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(exit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).pc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).ps as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(ps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a0 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a4 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a5 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a6 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a7 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a8 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a9 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a10 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a10)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a11 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a11)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a12 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a13 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a14 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a14)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).a15 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(a15)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).sar as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(sar)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).exccause as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(exccause)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).excvaddr as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(excvaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).lbeg as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(lbeg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).lend as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(lend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).lcount as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(lcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).tmp0 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(tmp0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).tmp1 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(tmp1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtExcFrame>())).tmp2 as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(XtExcFrame),
            "::",
            stringify!(tmp2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XtSolFrame {
    pub exit: chlorine::c_long,
    pub pc: chlorine::c_long,
    pub ps: chlorine::c_long,
    pub next: chlorine::c_long,
    pub a0: chlorine::c_long,
    pub a1: chlorine::c_long,
    pub a2: chlorine::c_long,
    pub a3: chlorine::c_long,
}
#[test]
fn bindgen_test_layout_XtSolFrame() {
    assert_eq!(
        ::core::mem::size_of::<XtSolFrame>(),
        32usize,
        concat!("Size of: ", stringify!(XtSolFrame))
    );
    assert_eq!(
        ::core::mem::align_of::<XtSolFrame>(),
        4usize,
        concat!("Alignment of ", stringify!(XtSolFrame))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).exit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(exit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).pc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).ps as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(ps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).next as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).a0 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).a1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).a2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<XtSolFrame>())).a3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XtSolFrame),
            "::",
            stringify!(a3)
        )
    );
}
extern "C" {
    pub fn vPortPanic(
        file: *const chlorine::c_char,
        file_len: usize,
        line: usize,
        func: *const chlorine::c_char,
        func_len: usize,
    );
}
extern "C" {
    pub fn strlen(str_: *const chlorine::c_char) -> chlorine::c_uint;
}
pub type TaskFunction_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut chlorine::c_void)>;
pub type StackType_t = u32;
pub type BaseType_t = chlorine::c_int;
pub type UBaseType_t = chlorine::c_uint;
pub type TickType_t = u32;
extern "C" {
    pub fn vTaskEnterCritical();
}
extern "C" {
    pub fn vTaskExitCritical();
}
extern "C" {
    pub fn vPortYield();
}
extern "C" {
    pub fn _frxt_setup_switch();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMPU_SETTINGS {
    pub coproc_area: *mut StackType_t,
}
#[test]
fn bindgen_test_layout_xMPU_SETTINGS() {
    assert_eq!(
        ::core::mem::size_of::<xMPU_SETTINGS>(),
        4usize,
        concat!("Size of: ", stringify!(xMPU_SETTINGS))
    );
    assert_eq!(
        ::core::mem::align_of::<xMPU_SETTINGS>(),
        4usize,
        concat!("Alignment of ", stringify!(xMPU_SETTINGS))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMPU_SETTINGS>())).coproc_area as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xMPU_SETTINGS),
            "::",
            stringify!(coproc_area)
        )
    );
}
extern "C" {
    pub fn pxPortInitialiseStack(
        pxTopOfStack: *mut StackType_t,
        pxCode: TaskFunction_t,
        pvParameters: *mut chlorine::c_void,
        xRunPrivileged: BaseType_t,
    ) -> *mut StackType_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HeapRegion {
    pub pucStartAddress: *mut u8,
    pub xSizeInBytes: usize,
}
#[test]
fn bindgen_test_layout_HeapRegion() {
    assert_eq!(
        ::core::mem::size_of::<HeapRegion>(),
        8usize,
        concat!("Size of: ", stringify!(HeapRegion))
    );
    assert_eq!(
        ::core::mem::align_of::<HeapRegion>(),
        4usize,
        concat!("Alignment of ", stringify!(HeapRegion))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<HeapRegion>())).pucStartAddress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HeapRegion),
            "::",
            stringify!(pucStartAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<HeapRegion>())).xSizeInBytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HeapRegion),
            "::",
            stringify!(xSizeInBytes)
        )
    );
}
pub type HeapRegion_t = HeapRegion;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xHeapStats {
    pub xAvailableHeapSpaceInBytes: usize,
    pub xSizeOfLargestFreeBlockInBytes: usize,
    pub xSizeOfSmallestFreeBlockInBytes: usize,
    pub xNumberOfFreeBlocks: usize,
    pub xMinimumEverFreeBytesRemaining: usize,
    pub xNumberOfSuccessfulAllocations: usize,
    pub xNumberOfSuccessfulFrees: usize,
}
#[test]
fn bindgen_test_layout_xHeapStats() {
    assert_eq!(
        ::core::mem::size_of::<xHeapStats>(),
        28usize,
        concat!("Size of: ", stringify!(xHeapStats))
    );
    assert_eq!(
        ::core::mem::align_of::<xHeapStats>(),
        4usize,
        concat!("Alignment of ", stringify!(xHeapStats))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xAvailableHeapSpaceInBytes as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xAvailableHeapSpaceInBytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xSizeOfLargestFreeBlockInBytes as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xSizeOfLargestFreeBlockInBytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xSizeOfSmallestFreeBlockInBytes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xSizeOfSmallestFreeBlockInBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xHeapStats>())).xNumberOfFreeBlocks as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xNumberOfFreeBlocks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xMinimumEverFreeBytesRemaining as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xMinimumEverFreeBytesRemaining)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xNumberOfSuccessfulAllocations as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xNumberOfSuccessfulAllocations)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xHeapStats>())).xNumberOfSuccessfulFrees as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xHeapStats),
            "::",
            stringify!(xNumberOfSuccessfulFrees)
        )
    );
}
pub type HeapStats_t = xHeapStats;
extern "C" {
    pub fn vPortDefineHeapRegions(pxHeapRegions: *const HeapRegion_t);
}
extern "C" {
    pub fn vPortGetHeapStats(pxHeapStats: *mut HeapStats_t);
}
extern "C" {
    pub fn pvPortMalloc(xSize: usize) -> *mut chlorine::c_void;
}
extern "C" {
    pub fn vPortFree(pv: *mut chlorine::c_void);
}
extern "C" {
    pub fn vPortInitialiseBlocks();
}
extern "C" {
    pub fn xPortGetFreeHeapSize() -> usize;
}
extern "C" {
    pub fn xPortGetMinimumEverFreeHeapSize() -> usize;
}
extern "C" {
    pub fn xPortStartScheduler() -> BaseType_t;
}
extern "C" {
    pub fn vPortEndScheduler();
}
extern "C" {
    pub fn vPortStoreTaskMPUSettings(
        xMPUSettings: *mut xMPU_SETTINGS,
        xRegions: *const xMEMORY_REGION,
        pxBottomOfStack: *mut StackType_t,
        ulStackDepth: u32,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut chlorine::c_void; 4usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_LIST_ITEM>(),
        20usize,
        concat!("Size of: ", stringify!(xSTATIC_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST_ITEM>())).xDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST_ITEM),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST_ITEM>())).pvDummy3 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST_ITEM),
            "::",
            stringify!(pvDummy3)
        )
    );
}
pub type StaticListItem_t = xSTATIC_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_MINI_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut chlorine::c_void; 2usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_MINI_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_MINI_LIST_ITEM>(),
        12usize,
        concat!("Size of: ", stringify!(xSTATIC_MINI_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_MINI_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_MINI_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_MINI_LIST_ITEM>())).xDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_MINI_LIST_ITEM),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_MINI_LIST_ITEM>())).pvDummy3 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_MINI_LIST_ITEM),
            "::",
            stringify!(pvDummy3)
        )
    );
}
pub type StaticMiniListItem_t = xSTATIC_MINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST {
    pub uxDummy2: UBaseType_t,
    pub pvDummy3: *mut chlorine::c_void,
    pub xDummy4: StaticMiniListItem_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_LIST>(),
        20usize,
        concat!("Size of: ", stringify!(xSTATIC_LIST))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_LIST>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_LIST))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).uxDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(uxDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).pvDummy3 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(pvDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).xDummy4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(xDummy4)
        )
    );
}
pub type StaticList_t = xSTATIC_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TCB {
    pub pxDummy1: *mut chlorine::c_void,
    pub xDummy2: xMPU_SETTINGS,
    pub xDummy3: [StaticListItem_t; 2usize],
    pub uxDummy5: UBaseType_t,
    pub pxDummy6: *mut chlorine::c_void,
    pub ucDummy7: [u8; 16usize],
    pub uxDummy9: UBaseType_t,
    pub uxDummy12: [UBaseType_t; 2usize],
    pub pvDummy15: [*mut chlorine::c_void; 1usize],
    pub ulDummy18: [u32; 1usize],
    pub ucDummy19: [u8; 1usize],
    pub uxDummy20: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TCB() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_TCB>(),
        96usize,
        concat!("Size of: ", stringify!(xSTATIC_TCB))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_TCB>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_TCB))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pxDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pxDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).xDummy2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).xDummy3 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy5 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pxDummy6 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pxDummy6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ucDummy7 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ucDummy7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy9 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy12 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pvDummy15 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pvDummy15)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ulDummy18 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ulDummy18)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ucDummy19 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ucDummy19)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy20 as *const _ as usize },
        93usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy20)
        )
    );
}
pub type StaticTask_t = xSTATIC_TCB;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xSTATIC_QUEUE {
    pub pvDummy1: [*mut chlorine::c_void; 3usize],
    pub u: xSTATIC_QUEUE__bindgen_ty_1,
    pub xDummy3: [StaticList_t; 2usize],
    pub uxDummy4: [UBaseType_t; 3usize],
    pub ucDummy5: [u8; 2usize],
    pub pvDummy7: *mut chlorine::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xSTATIC_QUEUE__bindgen_ty_1 {
    pub pvDummy2: *mut chlorine::c_void,
    pub uxDummy2: UBaseType_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_QUEUE__bindgen_ty_1>())).pvDummy2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE__bindgen_ty_1),
            "::",
            stringify!(pvDummy2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_QUEUE__bindgen_ty_1>())).uxDummy2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE__bindgen_ty_1),
            "::",
            stringify!(uxDummy2)
        )
    );
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_QUEUE>(),
        76usize,
        concat!("Size of: ", stringify!(xSTATIC_QUEUE))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_QUEUE>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_QUEUE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).pvDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(pvDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).u as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).xDummy3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).uxDummy4 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(uxDummy4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).ucDummy5 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(ucDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).pvDummy7 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(pvDummy7)
        )
    );
}
pub type StaticQueue_t = xSTATIC_QUEUE;
pub type StaticSemaphore_t = StaticQueue_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_EVENT_GROUP {
    pub xDummy1: TickType_t,
    pub xDummy2: StaticList_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_EVENT_GROUP() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_EVENT_GROUP>(),
        24usize,
        concat!("Size of: ", stringify!(xSTATIC_EVENT_GROUP))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_EVENT_GROUP>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_EVENT_GROUP))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_EVENT_GROUP>())).xDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_EVENT_GROUP),
            "::",
            stringify!(xDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_EVENT_GROUP>())).xDummy2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_EVENT_GROUP),
            "::",
            stringify!(xDummy2)
        )
    );
}
pub type StaticEventGroup_t = xSTATIC_EVENT_GROUP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TIMER {
    pub pvDummy1: *mut chlorine::c_void,
    pub xDummy2: StaticListItem_t,
    pub xDummy3: TickType_t,
    pub pvDummy5: *mut chlorine::c_void,
    pub pvDummy6: TaskFunction_t,
    pub ucDummy8: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TIMER() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_TIMER>(),
        40usize,
        concat!("Size of: ", stringify!(xSTATIC_TIMER))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_TIMER>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_TIMER))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).xDummy2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).xDummy3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy5 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy6 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).ucDummy8 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(ucDummy8)
        )
    );
}
pub type StaticTimer_t = xSTATIC_TIMER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_STREAM_BUFFER {
    pub uxDummy1: [usize; 4usize],
    pub pvDummy2: [*mut chlorine::c_void; 3usize],
    pub ucDummy3: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_STREAM_BUFFER() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_STREAM_BUFFER>(),
        32usize,
        concat!("Size of: ", stringify!(xSTATIC_STREAM_BUFFER))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_STREAM_BUFFER>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_STREAM_BUFFER))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).uxDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(uxDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).pvDummy2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(pvDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).ucDummy3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(ucDummy3)
        )
    );
}
pub type StaticStreamBuffer_t = xSTATIC_STREAM_BUFFER;
pub type StaticMessageBuffer_t = StaticStreamBuffer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
    pub pvOwner: *mut chlorine::c_void,
    pub pvContainer: *mut xLIST,
}
#[test]
fn bindgen_test_layout_xLIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xLIST_ITEM>(),
        20usize,
        concat!("Size of: ", stringify!(xLIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xLIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xLIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).xItemValue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(xItemValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pxNext as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pxNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pxPrevious as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pxPrevious)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pvOwner as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pvOwner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pvContainer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pvContainer)
        )
    );
}
pub type ListItem_t = xLIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMINI_LIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
}
#[test]
fn bindgen_test_layout_xMINI_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xMINI_LIST_ITEM>(),
        12usize,
        concat!("Size of: ", stringify!(xMINI_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xMINI_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xMINI_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).xItemValue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(xItemValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).pxNext as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(pxNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).pxPrevious as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(pxPrevious)
        )
    );
}
pub type MiniListItem_t = xMINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST {
    pub uxNumberOfItems: UBaseType_t,
    pub pxIndex: *mut ListItem_t,
    pub xListEnd: MiniListItem_t,
}
#[test]
fn bindgen_test_layout_xLIST() {
    assert_eq!(
        ::core::mem::size_of::<xLIST>(),
        20usize,
        concat!("Size of: ", stringify!(xLIST))
    );
    assert_eq!(
        ::core::mem::align_of::<xLIST>(),
        4usize,
        concat!("Alignment of ", stringify!(xLIST))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).uxNumberOfItems as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(uxNumberOfItems)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).pxIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(pxIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).xListEnd as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(xListEnd)
        )
    );
}
pub type List_t = xLIST;
extern "C" {
    pub fn vListInitialise(pxList: *mut List_t);
}
extern "C" {
    pub fn vListInitialiseItem(pxItem: *mut ListItem_t);
}
extern "C" {
    pub fn vListInsert(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
    pub fn vListInsertEnd(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
    pub fn uxListRemove(pxItemToRemove: *mut ListItem_t) -> UBaseType_t;
}
#[doc = " task. h"]
#[doc = ""]
#[doc = " Type by which tasks are referenced.  For example, a call to xTaskCreate"]
#[doc = " returns (via a pointer parameter) an TaskHandle_t variable that can then"]
#[doc = " be used as a parameter to vTaskDelete to delete the task."]
#[doc = ""]
#[doc = " \\defgroup TaskHandle_t TaskHandle_t"]
#[doc = " \\ingroup Tasks"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tskTaskControlBlock {
    _unused: [u8; 0],
}
pub type TaskHandle_t = *mut tskTaskControlBlock;
pub type TaskHookFunction_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut chlorine::c_void) -> BaseType_t>;
pub const eTaskState_eRunning: eTaskState = 0;
pub const eTaskState_eReady: eTaskState = 1;
pub const eTaskState_eBlocked: eTaskState = 2;
pub const eTaskState_eSuspended: eTaskState = 3;
pub const eTaskState_eDeleted: eTaskState = 4;
pub const eTaskState_eInvalid: eTaskState = 5;
pub type eTaskState = chlorine::c_uint;
pub const eNotifyAction_eNoAction: eNotifyAction = 0;
pub const eNotifyAction_eSetBits: eNotifyAction = 1;
pub const eNotifyAction_eIncrement: eNotifyAction = 2;
pub const eNotifyAction_eSetValueWithOverwrite: eNotifyAction = 3;
pub const eNotifyAction_eSetValueWithoutOverwrite: eNotifyAction = 4;
pub type eNotifyAction = chlorine::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTIME_OUT {
    pub xOverflowCount: BaseType_t,
    pub xTimeOnEntering: TickType_t,
}
#[test]
fn bindgen_test_layout_xTIME_OUT() {
    assert_eq!(
        ::core::mem::size_of::<xTIME_OUT>(),
        8usize,
        concat!("Size of: ", stringify!(xTIME_OUT))
    );
    assert_eq!(
        ::core::mem::align_of::<xTIME_OUT>(),
        4usize,
        concat!("Alignment of ", stringify!(xTIME_OUT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTIME_OUT>())).xOverflowCount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTIME_OUT),
            "::",
            stringify!(xOverflowCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTIME_OUT>())).xTimeOnEntering as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTIME_OUT),
            "::",
            stringify!(xTimeOnEntering)
        )
    );
}
pub type TimeOut_t = xTIME_OUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMEMORY_REGION {
    pub pvBaseAddress: *mut chlorine::c_void,
    pub ulLengthInBytes: u32,
    pub ulParameters: u32,
}
#[test]
fn bindgen_test_layout_xMEMORY_REGION() {
    assert_eq!(
        ::core::mem::size_of::<xMEMORY_REGION>(),
        12usize,
        concat!("Size of: ", stringify!(xMEMORY_REGION))
    );
    assert_eq!(
        ::core::mem::align_of::<xMEMORY_REGION>(),
        4usize,
        concat!("Alignment of ", stringify!(xMEMORY_REGION))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).pvBaseAddress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(pvBaseAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).ulLengthInBytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(ulLengthInBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).ulParameters as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(ulParameters)
        )
    );
}
pub type MemoryRegion_t = xMEMORY_REGION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_PARAMETERS {
    pub pvTaskCode: TaskFunction_t,
    pub pcName: *const chlorine::c_char,
    pub usStackDepth: u16,
    pub pvParameters: *mut chlorine::c_void,
    pub uxPriority: UBaseType_t,
    pub puxStackBuffer: *mut StackType_t,
    pub xRegions: [MemoryRegion_t; 1usize],
}
#[test]
fn bindgen_test_layout_xTASK_PARAMETERS() {
    assert_eq!(
        ::core::mem::size_of::<xTASK_PARAMETERS>(),
        36usize,
        concat!("Size of: ", stringify!(xTASK_PARAMETERS))
    );
    assert_eq!(
        ::core::mem::align_of::<xTASK_PARAMETERS>(),
        4usize,
        concat!("Alignment of ", stringify!(xTASK_PARAMETERS))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pvTaskCode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pvTaskCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pcName as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pcName)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).usStackDepth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(usStackDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pvParameters as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pvParameters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).uxPriority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(uxPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xTASK_PARAMETERS>())).puxStackBuffer as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(puxStackBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).xRegions as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(xRegions)
        )
    );
}
pub type TaskParameters_t = xTASK_PARAMETERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_STATUS {
    pub xHandle: TaskHandle_t,
    pub pcTaskName: *const chlorine::c_char,
    pub xTaskNumber: UBaseType_t,
    pub eCurrentState: eTaskState,
    pub uxCurrentPriority: UBaseType_t,
    pub uxBasePriority: UBaseType_t,
    pub ulRunTimeCounter: u32,
    pub pxStackBase: *mut StackType_t,
    pub usStackHighWaterMark: u16,
}
#[test]
fn bindgen_test_layout_xTASK_STATUS() {
    assert_eq!(
        ::core::mem::size_of::<xTASK_STATUS>(),
        36usize,
        concat!("Size of: ", stringify!(xTASK_STATUS))
    );
    assert_eq!(
        ::core::mem::align_of::<xTASK_STATUS>(),
        4usize,
        concat!("Alignment of ", stringify!(xTASK_STATUS))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).xHandle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(xHandle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).pcTaskName as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(pcTaskName)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).xTaskNumber as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(xTaskNumber)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).eCurrentState as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(eCurrentState)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).uxCurrentPriority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(uxCurrentPriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).uxBasePriority as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(uxBasePriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).ulRunTimeCounter as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(ulRunTimeCounter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).pxStackBase as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(pxStackBase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xTASK_STATUS>())).usStackHighWaterMark as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(usStackHighWaterMark)
        )
    );
}
pub type TaskStatus_t = xTASK_STATUS;
pub const eSleepModeStatus_eAbortSleep: eSleepModeStatus = 0;
pub const eSleepModeStatus_eStandardSleep: eSleepModeStatus = 1;
pub const eSleepModeStatus_eNoTasksWaitingTimeout: eSleepModeStatus = 2;
pub type eSleepModeStatus = chlorine::c_uint;
extern "C" {
    pub fn xTaskCreate(
        pxTaskCode: TaskFunction_t,
        pcName: *const chlorine::c_char,
        usStackDepth: u16,
        pvParameters: *mut chlorine::c_void,
        uxPriority: UBaseType_t,
        pxCreatedTask: *mut TaskHandle_t,
    ) -> BaseType_t;
}
extern "C" {
    pub fn xTaskCreateRestricted(
        pxTaskDefinition: *const TaskParameters_t,
        pxCreatedTask: *mut TaskHandle_t,
    ) -> BaseType_t;
}
extern "C" {
    #[doc = " task. h"]
    #[doc = " <pre>"]
